Tekla Open API Reference for Tekla Structures 2025
BaseLinePlacing Properties
The BaseLinePlacing type exposes the following members.
Properties
Name | Description
EndPoint
 Sets the end point of the line that the object is using for the placement.
StartPoint
 Sets the start point of the line that the object is using for the placement.
Top
See Also
Reference
BaseLinePlacing Class
Tekla.Structures.Drawing Namespace